#!/bin/bash

GREEN="\033[32m"
YALLOW="\033[33m"
GRAY="\033[37m"
echo "------------------------------------------------------------------------------"
echo "-||----||--||--||----------||||||---------------------------------------------"
echo "-||----||------||--------||---------------------------------------------------"
echo "-||||||||--||--||--------||||||||---------------------------------------------"
echo "-||----||--||--||--------------||---------------------------------------------"
echo "-||----||--||--||||||||--||||||-----------------------------------------------"
echo "------------------------------------------------------------------------------"

echo "$GREEN Webserver by HiLsAger"
echo "$GREEN github: https://github.com/HiLsAger/webserver"

echo "$GRAY Команды взаимодействия:"

echo "$YALLOW - webserver-run $GRAY- Запуск докер контейнера и вебсервера"
echo "$YALLOW - webserver-stop $GRAY- Остановить докера контейнера"
echo "$YALLOW - webserver-bush $GRAY- получить доступ к консоли внутри докер контейнера"
echo "$YALLOW - webserver-restart $GRAY- Перезапуск вебсервера внутри контейнера"
echo "$YALLOW - webserver-help $GRAY- Получить больше информации по работе с вебсервером"
echo "$YALLOW - webserver-rebuild $GRAY- Пересобрать сборку docker"
echo "------------------------------------------------------------------------------"